---
kind: method
id: M:Autodesk.Revit.DB.Point.Create(Autodesk.Revit.DB.XYZ)
zh: 创建、新建、生成、建立、新增
source: html/e37a56e7-d8e6-8f94-47d4-a508a62c39e5.htm
---
# Autodesk.Revit.DB.Point.Create Method

**中文**: 创建、新建、生成、建立、新增

Creates a point at the given coordinates.

## Syntax (C#)
```csharp
public static Point Create(
	XYZ coord
)
```

## Parameters
- **coord** (`Autodesk.Revit.DB.XYZ`) - The coordinates where the point will be created.

## Returns
A Point object.